Revit 2024 API
FamilyParameter Class
The family parameter object.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public class FamilyParameter : APIObject
Visual Basic
Public Class FamilyParameter _
	Inherits APIObject
Visual C++
public ref class FamilyParameter : public APIObject
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.APIObject
 Autodesk.Revit.DB.FamilyParameter
See Also
FamilyParameter Members
Autodesk.Revit.DB Namespace